[{


    "chefs": [
        {
          "chefId": "1",
          "chefPicture": "https://i.postimg.cc/dQdPcSpf/chef-11.jpg",
          "chefName": "John Smith",
          "chefBio": " John Smith is a chef with 15 years of experience and has created 50 recipes. He has received 1000 likes from his audience. John's signature dishes include Classic Mac and Cheese, BBQ Pulled Pork, and Southern Fried Chicken, each with their unique twist. His Classic Mac and Cheese recipe includes cheddar cheese, butter, flour, and milk, while his BBQ Pulled Pork recipe includes pork shoulder, BBQ sauce, brown sugar, garlic, and onion. Finally, his Southern Fried Chicken recipe requires chicken, buttermilk, flour, paprika, and salt. His recipes have received high ratings from his audience, with his Classic Mac and Cheese recipe having a rating of 4.8 out of 5, his BBQ Pulled Pork recipe having a rating of 4.5 out of 5, and his Southern Fried Chicken recipe having a rating of 4.2 out of 5.",
          "yearsOfExperience": 15,
          "numRecipes": 50,
          "numLikes": 1000,
          "recipes": [
            {
              "recipeName": "Classic Mac and Cheese",
              "ingredients": ["macaroni", "cheddar cheese", "butter", "flour", "milk"],
              "cookingMethod": "Cook macaroni according to package instructions. Melt butter in a saucepan, whisk in flour to create a roux. Slowly add milk and continue whisking until smooth. Stir in grated cheddar cheese until melted. Combine macaroni and cheese sauce. Serve hot.",
              "rating": 4.8
            },
            {
              "recipeName": "BBQ Pulled Pork",
              "ingredients": ["pork shoulder", "BBQ sauce", "brown sugar", "garlic", "onion"],
              "cookingMethod": "Rub pork shoulder with brown sugar, garlic, and onion. Slow cook in a crockpot for 6-8 hours. Shred pork and mix with BBQ sauce. Serve on a bun with coleslaw.",
              "rating": 4.5
            },
            {
              "recipeName": "Southern Fried Chicken",
              "ingredients": ["chicken", "buttermilk", "flour", "paprika", "salt"],
              "cookingMethod": "Soak chicken in buttermilk overnight. Mix flour, paprika, and salt in a separate bowl. Dredge chicken in flour mixture and fry in hot oil until golden brown and cooked through. Serve hot.",
              "rating": 4.2
            }
          ]
        },

        {
            "chefId": "2",
            "chefPicture": "https://i.postimg.cc/x8Zm91cw/chef2.jpg",
            "chefName": "Gordon Ramsay",
            "chefBio": "Gordon Ramsay is a chef with 10 years of experience and is known for her delicious seafood dishes. Gordon Ramsay has created 30 recipes and has received 800 likes for her work. Gordon Ramsay's popular dishes include New England Clam Chowder, Shrimp and Grits, and Key Lime Pie. His New England Clam Chowder recipe features clams, potatoes, onion, celery, and bacon. Emily's Shrimp and Grits recipe includes shrimp, grits, butter, garlic, and cheese. Finally, his Key Lime Pie recipe uses graham cracker crumbs, butter, sweetened condensed milk, key lime juice, and whipped cream.",
            "yearsOfExperience": 10,
            "numRecipes": 30,
            "numLikes": 800,
            "recipes": [
              {
                "recipeName": "New England Clam Chowder",
                "ingredients": ["clams", "potatoes", "onion", "celery", "bacon"],
                "cookingMethod": "Cook bacon until crispy. Add onion and celery and cook until softened. Add potatoes and clam juice and simmer until potatoes are cooked through. Add clams and cream, and simmer until heated through. Serve hot.",
                "rating": 4.7
              },
              {
                "recipeName": "Shrimp and Grits",
                "ingredients": ["shrimp", "grits", "butter", "garlic", "cheese"],
                "cookingMethod": "Cook grits according to package instructions. In a separate pan, melt butter and cook garlic until fragrant. Add shrimp and cook until pink. Serve shrimp on top of grits, sprinkled with grated cheese.",
                "rating": 4.4
              },
              {
                "recipeName": "Key Lime Pie",
                "ingredients": ["graham cracker crumbs", "butter", "sweetened condensed milk", "key lime juice", "whipped cream"],
                "cookingMethod": "Mix graham cracker crumbs and melted butter and press into a pie dish. Mix condensed milk and key lime juice and pour into crust. Bake for 10-15 minutes. Chill in the refrigerator for at least an hour. Top with whipped cream before serving.",
                "rating": 4.9
              }
            ]
          },
          {
            "chefId": "3",
            "chefPicture": "https://i.postimg.cc/v8xfv5kM/chef3.jpg",
            "chefName": "David Lee",
            "chefBio": "David Lee is a skilled chef with 12 years of experience in the culinary industry. He has shared 40 of his amazing recipes, which have received a total of 900 likes from his followers. His expertise includes making cheeseburgers, Tex-Mex chili, and Southern style biscuits and gravy, among others. David's cooking style is straightforward and authentic, and he enjoys experimenting with different flavor combinations.",
            "yearsOfExperience": 12,
            "numRecipes": 40,
            "numLikes": 900,
            "recipes": [
              {
                "recipeName": "Cheeseburger",
                "ingredients": ["ground beef", "cheese", "lettuce", "tomato", "onion"],
                "cookingMethod": "Form beef into patties and grill to desired doneness. Add cheese to melt. Serve on a bun with lettuce, tomato, and onion.",
                "rating": 4.6
              },
              {
                "recipeName": "Tex-Mex Chili",
                "ingredients": ["ground beef", "onion", "bell pepper", "canned tomatoes", "kidney beans"],
                "cookingMethod": "Brown beef and onion in a large pot. Add bell pepper and cook until softened. Add canned tomatoes and kidney beans. Simmer for 30 minutes. Serve hot with toppings such as cheese and sour cream.",
                "rating": 4.3
              },
              {
                "recipeName": "Southern Style Biscuits and Gravy",
                "ingredients": ["biscuits", "sausage", "flour", "milk", "salt"],
                "cookingMethod": "Cook sausage in a skillet until browned. Add flour and cook until browned. Slowly add milk and whisk until smooth. Simmer until thickened. Serve over warm biscuits.",
                "rating": 4.7
              }
            ]
          },
          {
            "chefId": "4",
            "chefPicture": "https://i.postimg.cc/QdCXpJYJ/chef4.jpg",
            "chefName": "Bobby Flay",
            "chefBio": "Bobby Flay is a skilled chef with 8 years of experience in the culinary arts. He has created a variety of recipes, with a focus on comfort foods and classic dishes. His Chicken Parmesan recipe is a fan favorite, featuring tender chicken breast coated in crispy breadcrumbs and topped with melted mozzarella cheese and tangy marinara sauce. His Jambalaya recipe is another crowd pleaser, combining the savory flavors of andouille sausage, chicken, and shrimp with rice and diced tomatoes. Bobby Flay's Apple Pie is the perfect ending to any meal, with its flaky crust and warm, spiced apple filling. With 25 recipes to her name and a loyal following of 700 fans, Bobby Flay is a chef to watch in the culinary world.",
            "yearsOfExperience": 8,
            "numRecipes": 25,
            "numLikes": 700,
            "recipes": [
              {
                "recipeName": "Chicken Parmesan",
                "ingredients": ["chicken breast", "breadcrumbs", "parmesan cheese", "marinara sauce", "mozzarella cheese"],
                "cookingMethod": "Dredge chicken in breadcrumbs and parmesan cheese. Bake in the oven until cooked through. Top with marinara sauce and mozzarella cheese. Bake until cheese is melted and bubbly. Serve hot with pasta.",
                "rating": 4.5
              },
              {
                "recipeName": "Jambalaya",
                "ingredients": ["andouille sausage", "chicken", "shrimp", "rice", "tomato"],
                "cookingMethod": "Brown sausage, chicken, and shrimp in a large pot. Add diced tomatoes and rice. Add enough water to cover and bring to a boil. Simmer until rice is cooked through. Serve hot.",
                "rating": 4.2
              },
              {
                "recipeName": "Apple Pie",
                "ingredients": ["pie crust", "apples", "sugar", "cinnamon", "nutmeg"],
                "cookingMethod": "Peel and slice apples. Mix with sugar, cinnamon, and nutmeg. Pour mixture into a pie crust. Bake in the oven until crust is golden brown and apples are soft. Serve hot with whipped cream.",
                "rating": 4.8
              }
            ]
          },
          {
            "chefId": "5",
            "chefPicture": "https://i.postimg.cc/RFB5b7d8/chef-5.jpg",
            "chefName": "Michael Johnson",
            "chefBio": "Michael Johnson is a chef with 12 years of experience in American cuisine. He has created 35 recipes that have been liked 900 times. Michael's signature dishes include a classic burger with fries, creamy mac and cheese, and chocolate chip cookies. He is known for his simple yet delicious recipes that are perfect for any occasion. Michael's passion for cooking started at a young age and he has been perfecting his craft ever since. His goal is to create dishes that not only taste amazing but are also easy to make at home.",
            "yearsOfExperience": 12,
            "numRecipes": 35,
            "numLikes": 900,
            "recipes": [
              {
                "recipeName": "Burger with Fries",
                "ingredients": ["ground beef", "buns", "lettuce", "tomato", "cheese", "ketchup", "mayonnaise", "french fries"],
                "cookingMethod": "Grill beef patty to desired doneness. Toast bun on the grill. Add lettuce, tomato, cheese, ketchup, and mayonnaise to the burger. Serve with french fries on the side.",
                "rating": 4.7
              },
              {
                "recipeName": "Mac and Cheese",
                "ingredients": ["macaroni", "butter", "flour", "milk", "cheddar cheese", "breadcrumbs"],
                "cookingMethod": "Boil macaroni until al dente. Melt butter in a pan and add flour to make a roux. Slowly add milk while stirring to make a creamy sauce. Add cheddar cheese and stir until melted. Add cooked macaroni to the sauce and mix well. Transfer to a baking dish, sprinkle with breadcrumbs, and bake until golden brown. Serve hot.",
                "rating": 4.5
              },
              {
                "recipeName": "Chocolate Chip Cookies",
                "ingredients": ["butter", "brown sugar", "white sugar", "egg", "vanilla extract", "all-purpose flour", "baking soda", "salt", "chocolate chips"],
                "cookingMethod": "Cream butter, brown sugar, and white sugar together. Add egg and vanilla extract and mix well. In a separate bowl, mix all-purpose flour, baking soda, and salt. Add dry ingredients to the butter mixture and mix until just combined. Fold in chocolate chips. Drop spoonfuls of dough onto a baking sheet and bake in the oven until golden brown. Serve warm.",
                "rating": 4.9
              }
            ]
          },

          

{
  "chefId": "6",
  "chefPicture": "https://i.postimg.cc/7L1Qhp1s/chef-6.jpg",
  "chefName": "John wick",
  "chefBio": "Chef John wick has 10 years of experience in American cuisine and has created 30 delicious recipes. With over 1200 likes, his recipes are a hit among food lovers. His specialties include BBQ pulled pork sandwiches, fried chicken, and apple cider doughnuts. ",
  "yearsOfExperience": 10,
  "numRecipes": 30,
  "numLikes": 1200,
  "recipes": [
    {
      "recipeName": "BBQ Pulled Pork Sandwich",
      "ingredients": ["pork shoulder", "barbecue sauce", "hamburger buns", "coleslaw"],
      "cookingMethod": "Rub the pork shoulder with a mixture of salt, pepper, and paprika. Slow cook in a crockpot with barbecue sauce until tender. Shred the pork with a fork and mix with more barbecue sauce. Serve on hamburger buns with coleslaw on top.",
      "rating": 4.6
    },
    {
      "recipeName": "Fried Chicken",
      "ingredients": ["chicken pieces", "buttermilk", "flour", "cornmeal", "paprika", "salt", "pepper", "vegetable oil"],
      "cookingMethod": "Marinate chicken in buttermilk for at least 30 minutes. Mix flour, cornmeal, paprika, salt, and pepper in a separate bowl. Dredge the chicken in the flour mixture. Heat vegetable oil in a large pan and fry the chicken until golden brown and crispy. Serve hot with your favorite dipping sauce.",
      "rating": 4.4
    },
    {
      "recipeName": "Apple Cider Doughnuts",
      "ingredients": ["all-purpose flour", "baking powder", "baking soda", "salt", "cinnamon", "nutmeg", "apple cider", "egg", "sugar", "butter", "powdered sugar"],
      "cookingMethod": "Mix all-purpose flour, baking powder, baking soda, salt, cinnamon, and nutmeg in a bowl. In another bowl, whisk together apple cider, egg, sugar, and melted butter. Add the wet ingredients to the dry ingredients and mix until just combined. Pipe or spoon the batter into a doughnut pan and bake until golden brown. Dust with powdered sugar before serving.",
      "rating": 4.8
    }
  ]
}
          
            
             

        



    ]














    }]